// -------------------- IncludeFile -----------------
#include "AppState.h"
// コンストラクタ
CAppState::CAppState()
{
	m_bIsIcon = TRUE;
}
// デストラクタ
CAppState::~CAppState()
{

}
// ------------------------------------------------------------------------
//　関数名	:setIsIcon					アイコン化の指定
//	引数	:bIsIcon					アイコン化の有無
//	戻り値	:							なし
// ------------------------------------------------------------------------
void CAppState::setIsIcon(BOOL bIsIcon)
{
	m_bIsIcon = bIsIcon;
}
// ------------------------------------------------------------------------
//　関数名	:getIsIcon					アイコン化の所得
//	引数	:							なし
//	戻り値	:							アイコン化の有無
// ------------------------------------------------------------------------
BOOL CAppState::getIsIcon()
{
	return m_bIsIcon;
}
